In [1]:
from sqlalchemy import create_engine, text
import pandas as pd 
import seaborn as sns
from matplotlib import pyplot as pyplot

In [2]:
database_name = "scooter"
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
''' 
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)

In [5]:
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [6]:
query = '''
SELECT *
FROM trips
LIMIT 100;
'''  
with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

In [7]:
trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [8]:
scooters.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel    False
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [12]:
query = '''
SELECT *
FROM scooters
WHERE chargelevel IS NULL
'''  
with engine.connect() as connection:
    nullValues = pd.read_sql(text(query), con = connection)

In [13]:
nullValues.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-22 13:29:17.060,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
1,2019-05-22 13:34:16.970,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
2,2019-05-22 13:39:17.527,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
3,2019-05-22 13:44:17.367,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
4,2019-05-24 13:46:07.707,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin

In [24]:
nullValues

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-22 13:29:17.060,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
1,2019-05-22 13:34:16.970,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
2,2019-05-22 13:39:17.527,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
3,2019-05-22 13:44:17.367,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
4,2019-05-24 13:46:07.707,36.148062,-86.806409,Powered6727031,Powered,None,Scooter,0.23,Spin
...,...,...,...,...,...,...,...,...,...
765,2019-07-28 04:52:11.000,36.158047,-86.789413,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
766,2019-07-28 04:57:11.000,36.157920,-86.789485,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
767,2019-07-28 05:02:38.000,36.158123,-86.789372,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
768,2019-07-28 05:07:38.000,36.158093,-86.789338,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt
769,2019-07-28 05:12:38.000,36.158297,-86.789378,Powered-9730f8bb-1322-08b6-6a73-cc2ee50a33a8,Powered,None,Scooter,0.30,Bolt

In [16]:
query = '''
SELECT
    MAX(pubdatetime) - MIN(pubdatetime) AS range
    FROM scooters;
'''  
with engine.connect() as connection:
    daterangescooters = pd.read_sql(text(query), con = connection)

In [17]:
daterangescooters.head()

                    range
0 91 days 23:58:15.753000

In [19]:
query = '''
SELECT
    MAX(pubtimestamp) - MIN(pubtimestamp) AS range
    FROM trips;
'''  
with engine.connect() as connection:
    daterangetrips = pd.read_sql(text(query), con = connection)

In [20]:
daterangetrips.head()

                    range
0 92 days 07:03:04.577000

In [11]:
trips.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

In [10]:
scooters['pubdatetime'] = pd.to_datetime(scooters['pubdatetime']) 
date_range = str(scooters['pubdatetime'].dt.date.min()) + ' to ' +str(scooters['pubdatetime'].dt.date.max())
print(date_range)

2019-05-01 to 2019-05-01

In [11]:
trips['pubtimestamp'] = pd.to_datetime(trips['pubtimestamp']) 
date_range = str(trips['pubtimestamp'].dt.date.min()) + ' to ' +str(trips['pubtimestamp'].dt.date.max())
print(date_range)

2019-05-01 to 2019-05-06

In [12]:
min_lat = scooters['latitude'].min()
max_lat = scooters['latitude'].max()
min_lon = scooters['longitude'].min()
max_lon = scooters['longitude'].max()
print(min_lat)
print(max_lat)
print(min_lon)
print(max_lon)

36.13573
36.191252
-86.820593
-86.750357

In [26]:
mergedScooters = pd.merge(scooters, trips, on=['companyname'], how='inner')
mergedScooters.head()

,pubdatetime,latitude,longitude,sumdid_x,sumdtype,chargelevel,sumdgroup,costpermin,companyname,pubtimestamp,...,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,2019-05-01 00:00:55.423,...,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.1571,-86.8036,36.1566,-86.8067,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,2019-05-01 00:05:55.570,...,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.1547,-86.7818,36.1565,-86.7868,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
2,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,2019-05-01 00:05:55.570,...,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.1494,-86.7795,36.1531,-86.7796,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
3,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,2019-05-01 00:05:55.570,...,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.1778,-86.7866,36.1774,-86.7876,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207
4,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,2019-05-01 00:05:55.570,...,2019-05-01,00:03:56.546666,2019-05-01,00:06:45.786666,36.1544,-86.7862,36.1515,-86.7844,"[(36.154368, -86.785909), (36.151689, -86.7843...",2019-05-02 05:30:24.317

In [28]:
query = '''
SELECT
	CASE 
	WHEN companyname = 'Bird' THEN 'Bird'
		WHEN companyname = 'Bolt' THEN 'Bolt'
		WHEN companyname = 'Gotcha' THEN 'Gotcha'
		WHEN companyname = 'Jump' THEN 'Jump'
		WHEN companyname = 'Lime' THEN 'Lime'
		WHEN companyname = 'Lyft' THEN 'Lyft'
		WHEN companyname = 'Spin' THEN 'Spin'
		END AS company_name
 	,COUNT(companyname) AS num_of_scooters
FROM scooters
WHERE sumdgroup iLike 'scooter'
GROUP BY company_name
ORDER BY num_of_scooters DESC;
'''  
with engine.connect() as connection:
    scootertotalscompany = pd.read_sql(text(query), con = connection)

In [29]:
scootertotalscompany

  company_name  num_of_scooters
0         Jump         21835098
1         Lime         16497732
2         Bird         12251590
3         Lyft          9087043
4         Spin          5559573
5       Gotcha          4679280
6         Bolt          3477198